package intro;

/**
 * Created by User on 16.02.2016.
 */
public class HomeWork1 {
    public static void main(String[] args) {

        //2. Написать программу, которая проверит, является ли число четным или нечетным
        int digit = 213;
        if (digit % 2 ==0)
            System.out.println("Digit ia even");
        else
            System.out.println("Digit is uneven");
    }
}
