/**
 * Created by novsky on 22.02.2016.
 */
public class HomeWork3 {
//    4. Создайте класс в котором будут 2 статических метода:
//            - перевод числа из 2ой в 10ную систему счисления
//    - перевод числа из 10ной в 2ную систему счисления
//    В методе main другого класса дайте возможность пользователю выбрать, что он хочет делать из 2х вариантов и вызовите соответствующую функцию.
//
//    Пример ввода:
//    Choose the option:
//            1 - Convert a number from binary to denary
//    2 - Convert a number from denary to binary
//    Enter: 2
//    Number: 12
//    Результат:
//            1100
}
